#+TITLE: Plan for Running cluster automation with setup-ovpl on local machine.
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  This document contains the realization plan for automating
   VLEAD's infrastructure using OpenVZ and ADS.  This
   automation is realized as series of [[https://github.com/vlead/lab-data-service/milestones?state=closed][milestones]].

* Milestone Snapshot 
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
   |   | S. | Mi | Req | Milestone                   | Plan | Status | Est | Act | Issues |
   |   | no | no | Map |                             |      |        | hrs | hrs |        |
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
   |   | 1. | 1. |     | [[https://gitlab.com/vlead-systems/cluster-automation/milestones/5][ADS configuration]]           | [[ADS Configuration][ref]]  | Closed |  84 | 111 | [[https://gitlab.com/vlead-systems/cluster-automation/issues?scope%3Dall&utf8%3D%25E2%259C%2593&state%3Dclosed&milestone_title%3DSetup%2520OpenVZ%2520cluster%2520automation%2520on%2520local%2520machine][ref]]    |
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
   |   | 2. | 2. |     | [[https://gitlab.com/vlead-systems/cluster-automation/milestones/6][Automate enabling ADS hooks]] | [[Automate enabling ADS hooks on ADS server][ref]]  | Closed |  17 |  21 | [[https://gitlab.com/vlead-systems/cluster-automation/milestones/6][ref]]    |
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
   |   | 3. |    |     | [[https://gitlab.com/vlead-systems/cluster-automation/milestones/7][One common file to edit]]     | [[One common file to edit and for setup OpenVZ cluster][ref]]  | Open   |   8 |   0 |        |
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
   |   |    |    |     | Total                       |      |        | 109 | 132 |        |
   | ^ |    |    |     |                             |      |        |  et |  at |        |
   |---+----+----+-----+-----------------------------+------+--------+-----+-----+--------|
  #+TBLFM: $2=@#+1
  #+TBLFM: @3$8=remote(rlz-pln-ml-5, $est)
  #+TBLFM: @3$9=remote(rlz-pln-ml-5, $act)
  #+TBLFM: @4$8=remote(rlz-pln-ml-6, $est)
  #+TBLFM: @4$9=remote(rlz-pln-ml-6, $act)
  #+TBLFM: @5$8=remote(rlz-pln-ml-7, $est)
  #+TBLFM: @5$9=remote(rlz-pln-ml-7, $act)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)

* Detailed Plans
** ADS Configuration
   This [[https://gitlab.com/vlead-systems/cluster-automation/milestones/5][milestone]] configures auto deployment service(ADS) in the
   cluster.  

#+caption:  ads-realization-plan
#+name: rlz-pln-ml-5
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    S. | Tasks                                            | Github | Expected | Actual |        Estimated |           Actual | Status | Assignee   |
|   |    NO |                                                  | Issues |   Effort | Effort |           Start/ |           Start, |        |            |
|   |       |                                                  |        |      (in |    (in |              End |              End |        |            |
|   |       |                                                  |        |   person | person |            Dates |            Dates |        |            |
|   |       |                                                  |        |   hours) | hours) |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    1. | Install centos-6.9 os                            | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        8 |      5 |       09-09-2017 |       11-09-2017 | Done   | Raghupathi |
|   |       | and required packages                            |        |          |        |       11-09-2017 |       11-09-2017 |        |            |
|   |       | for cluster automation                           |        |          |        |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    2. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 |       12-09-2017 |       12-09-2017 | Done   | Raghupathi |
|   |       | install OpenVZ without                           |        |          |        |       13-09-2017 |       13-09-2017 |        |            |
|   |       | install dependecies and mongodb                  |        |          |        |                  |                  |        |            |
|   |       | using setup-centos repo                          |        |          |        |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    3. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 |       12-09-2017 |       12-09-2017 | Done   | Raghupathi |
|   |       | install dependencies without                     |        |          |        |       13-09-2017 |       13-09-2017 |        |            |
|   |       | OpenVZ using setup-centos repo                   |        |          |        |                  |                  |        |            |
|   |       | on Base4 container                               |        |          |        |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    4. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        8 |      4 |       13-09-2017 |       13-09-2017 | Done   | Raghupathi |
|   |       | install tornado-4.3 on Base4 container           |        |          |        |       14-09-2017 |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    5. | Update ansible scripts                           | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |       24 |     10 |       13-09-2017 |       24-09-2017 | Done   | Raghupathi |
|   |       | to run playbooks on hostmache                    |        |          |        |       22-09-2017 |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    6. | Adding base-machine-setup.yml,                   | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        5 |      3 |       24-09-2017 |       25-09-2017 | Done   | Raghupathi |
|   |       | ads.yml and tornado.yml files into               |        |          |        |       25-09-2017 |                  |        |            |
|   |       | cluster automation machine implementation        |        |          |        |                  |                  |        |            |
|   |       | yml files                                        |        |          |        |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    7. | Run bootstrap.sh script on local machine         | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        4 |      3 |       25-09-2017 |       25-09-2017 | Done   | Raghupathi |
|   |       |                                                  |        |          |        |       25-09-2017 |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    8. | Deploy a lab on local machine using ADS service. | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        3 |      8 |       25-09-2017 |                  |        |            |
|   |       |                                                  |        |          |        |       02-10-2017 |       02-10-2017 | Done   | Raghupathi |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |    9. | Install OpenVZ using ansible script              |        |        8 |     16 |       26-10-2017 |       26-10-2017 | Done   | Raghupathi |
|   |       | on host machine                                  | [[https://gitlab.com/vlead-systems/cluster-automation/issues/22][#22]]    |          |        |       26-10-2017 |       26-10-2017 |        |            |
|   |       |                                                  |        |          |        |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |   10. | Install dependecies                              | [[https://gitlab.com/vlead-systems/cluster-automation/issues/23][#23]]    |        8 |     16 | [2017-10-25 Wed] | [2017-10-27 Fri] | Done   | Siva &     |
|   |       | on ADS container                                 |        |          |        |                  | [2017-10-30 Mon] |        | Raghupathi |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   |   11. | Configure ADS using                              | [[https://gitlab.com/vlead-systems/cluster-automation/issues/23][#23]]    |        8 |     40 | [2017-11-01 Wed] | [2017-11-01 Wed] | Done   | Siva &     |
|   |       | ansible scripts                                  |        |          |        |                  | [2017-11-08 Wed] |        | Raghupathi |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
|   | Total |                                                  |        |       84 |    111 |                  |                  |        |            |
| ^ |       |                                                  |        |      est |    act |                  |                  |        |            |
|---+-------+--------------------------------------------------+--------+----------+--------+------------------+------------------+--------+------------|
#+TBLFM: $2=@#+1
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)




** Automate enabling ADS hooks on ADS server
   #+caption: realization-plan
   #+name: rlz-pln-ml-6
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    S. | Tasks                              | Github/ | Expected | Actual | Estimated        | Actual           | Status | Assignee     |
  |   |    NO |                                    | GitLab/ |   Effort | Effort | Start/           | Start,           |        |              |
  |   |       |                                    | Issues  |      (in |    (in | End              | End              |        |              |
  |   |       |                                    |         |   person | person | Dates            | Dates            |        |              |
  |   |       |                                    |         |   hours) | hours) |                  |                  |        |              |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    1. | Copy public-key of ads server      | [[https://gitlab.com/vlead-systems/cluster-automation/issues/24][#24]]     |        8 |     10 | [2017-11-07 Tue] | [2017-11-09 Thu] | Done   | Siva Shanker |
  |   |       | to ansible server's vlead user     |         |          |        |                  | [2017-11-10 Fri] |        |              |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    2. | Update nameserver in ADS server    | [[https://gitlab.com/vlead-systems/cluster-automation/issues/25][#25]]     |        4 |      5 | [2017-11-13 Mon] | [2017-11-13 Mon] | Done   | Siva Shanker |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    3. | Set proxy in ADS server            | [[https://gitlab.com/vlead-systems/cluster-automation/issues/26][#26]]     |        2 |      2 | [2017-11-13 Mon] | [2017-11-13 Mon] | Done   | Siva Shanker |
  |   |       | to run ads-web-app/app.py          |         |          |        |                  |                  |        |              |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    4. | Testing 3                          | [[https://gitlab.com/vlead-systems/cluster-automation/issues/26][#26]]     |        2 |      3 | [2017-11-14 Tue] | [2017-11-14 Tue] | Done   | Siva Shanker |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   |    5. | update steps for adding public-key | [[https://gitlab.com/vlead-systems/cluster-automation/issues/27][#27]]     |        1 |      1 | [2017-11-14 Tue] | [2017-11-14 Tue] | Done   | Siva Shanker |
  |   |       | on GitLab Systems-model repo       |         |          |        |                  |                  |        |              |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
  |   | Total |                                    |         |       17 |     21 |                  |                  |        |              |
  | ^ |       |                                    |         |      est |    act |                  |                  |        |              |
  |---+-------+------------------------------------+---------+----------+--------+------------------+------------------+--------+--------------|
#+TBLFM: $2=@#+1
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

** One common file to edit and for setup OpenVZ cluster 

   #+caption: realization-plan
   #+name: rlz-pln-ml-7
  |---+-------+-----------------------------+---------+----------+--------+------------------+--------+--------+--------------|
  |   | S.    | Tasks                       | Github/ | Expected | Actual | Estimated        | Actual | Status | Assignee     |
  |   | NO    |                             | GitLab/ | Effort   | Effort | Start/           | Start, |        |              |
  |   |       |                             | Issues  | (in      | (in    | End              | End    |        |              |
  |   |       |                             |         | person   | person | Dates            | Dates  |        |              |
  |   |       |                             |         | hours)   | hours) |                  |        |        |              |
  |---+-------+-----------------------------+---------+----------+--------+------------------+--------+--------+--------------|
  |   | 1.    | One place to edit variables | [[https://gitlab.com/vlead-systems/cluster-automation/issues/28][#28]]     | 8        |        | [2017-11-15 Wed] |        | TBD    | Siva Shanker |
  |   |       | of cluster-automation       |         |          |        |                  |        |        |              |
  |---+-------+-----------------------------+---------+----------+--------+------------------+--------+--------+--------------|
  |   | Total |                             |         | 8        | 0      |                  |        |        |              |
  | ^ |       |                             |         | est      | act    |                  |        |        |              |
  |---+-------+-----------------------------+---------+----------+--------+------------------+--------+--------+--------------|
#+TBLFM: $2=@#+1
#+TBLFM: $est=vsum(@II+1..@-1)
#+TBLFM: $act=vsum(@II+1..@-1)

